Repository: KelvinNovais/Kasasa
Catalog: po/*.po
Languages: ar, de, es_es, fr, it, nl, pt_br, pt_pt, ru, uk, vi

source: The IPython Console Plugin allows real-time interaction with a selected item in the <link xref="desktop_tree_view"> Application Tree View</link>. Since the IPython Console Plugin is an interactive Python shell, you can import any Python modules you want.
vi: Plugin Bảng điều khiển IPython cho phép tương tác thời gian thực với một mục đã chọn trong <link xref="desktop_tree_view">Ô xem cây ứng dụng</link>. Vì Plugin Bảng điều khiển IPython là một shell Python tương tác, bạn có thể nhập bất kỳ mô-đun Python nào bạn muốn.

source: Make sure you have the standalone package IPython installed in your system. Otherwise, the IPython Console Plugin will not work properly.
vi: Đảm bảo rằng bạn đã cài đặt gói IPython độc lập trong hệ thống của mình. Nếu không, Plugin Bảng điều khiển IPython sẽ không hoạt động đúng.

source: Running the IPython Console Plugin
vi: Chạy Plugin Bảng điều khiển IPython

source: To run the IPython Console Plugin, select one of the accessible items listed in the Application Tree View - either an application or a widget. In the plugin, the selected item will correspond to the variable 'acc'.
vi: Để chạy Plugin Bảng điều khiển IPython, hãy chọn một trong các mục có thể tiếp cận được được liệt kê trong Ô xem cây ứng dụng - hoặc là một ứng dụng hoặc là một widget. Trong plugin, mục đã chọn sẽ tương ứng với biến 'acc'.

source: Pressing <key>Tab</key> shows completions for the current command in the console, what can be useful for discovering pyatspi methods.
vi: Nhấn <key>Tab</key> sẽ hiển thị các đề xuất hoàn thành cho lệnh hiện tại trong bảng điều khiển, điều này có thể hữu ích cho việc khám phá các phương thức pyatspi.

source: Investigating selected items with the IPython Console Plugin
vi: Điều tra các mục đã chọn bằng Plugin Bảng điều khiển IPython

source: The IPython Console Plugin lets you investigate methods, constants, and properties related to a selected item in the Application Tree View.
vi: Plugin Bảng điều khiển IPython cho phép bạn điều tra các phương thức, hằng số và thuộc tính liên quan đến một mục đã chọn trong Ô xem cây ứng dụng.

# _
source: external ref='figures/IPython_plugin.png' md5='1daff78264babd667a8527b3e2b5cace'
vi: tham chiếu ngoài='figures/IPython_plugin.png'

source: Typing <cmd>help(acc)</cmd> in the IPython Console Plugin shows some useful documentation about the corresponding selected accessible item.
vi: Gõ <cmd>help(acc)</cmd> trong Plugin Bảng điều khiển IPython hiển thị một số tài liệu hữu ích về mục có thể tiếp cận được đã chọn tương ứng.

# sort
source: 4. Preferences
vi: 4. Tùy chọn

source: Customizing <app>Accerciser</app>'s preferences
vi: Tùy chỉnh các tùy chọn của <app>Accerciser</app>

source: Configuring <app>Accerciser</app>
vi: Cấu hình <app>Accerciser</app>

source: To configure plugins, hotkeys, and highlighting, do either <keyseq><key>ctrl</key><key>p</key></keyseq> or <guiseq><gui>Edit</gui> <gui>Preferences</gui></guiseq> to open a dialog.
vi: Để cấu hình các plugin, phím nóng và tô sáng, hãy thực hiện <keyseq><key>ctrl</key><key>p</key></keyseq> hoặc <guiseq><gui>Sửa</gui> <gui>Tùy chọn</gui></guiseq> để mở hộp thoại.

source: Configuring plugins
vi: Cấu hình các plugin

source: After opening the Preferences Dialog, you will find a list of all available plugins, with corresponding checkboxes, under the "Plugins" tab. To enable or disable a plugin, toggle its checkbox. Only active plugins can be accessed via <app>Accerciser</app>'s interface.
vi: Sau khi mở Hộp thoại Tùy chọn, bạn sẽ tìm thấy một danh sách tất cả các plugin có sẵn, với các hộp kiểm tương ứng, trong tab "Plugins". Để bật hoặc tắt một plugin, hãy chuyển đổi hộp kiểm của nó. Chỉ các plugin đang hoạt động mới có thể được truy cập thông qua giao diện của <app>Accerciser</app>.

source: Right-clicking on any given plugin allows you to choose its location: "Top Panel", "Bottom Panel", and "New View". Selecting "New View" creates a new window for the plugin.
vi: Nhấp chuột phải vào bất kỳ plugin nào cho phép bạn chọn vị trí của nó: "Top Panel" (Bảng điều khiển trên), "Bottom Panel" (Bảng điều khiển dưới) và "New View" (Chế độ xem mới). Chọn "New View" sẽ tạo một cửa sổ mới cho plugin.

source: You may bypass the Preferences dialog by using drag and drop to move a plugin from a location to another.
vi: Bạn có thể bỏ qua hộp thoại Tùy chọn bằng cách sử dụng kéo và thả để di chuyển một plugin từ vị trí này sang vị trí khác.

source: Configuring global hotkeys
vi: Cấu hình các phím nóng toàn cục

source: Some elements in <app>Accerciser</app> may enable certain functionalities via hotkeys. An example is the <link xref="quick_select_plugin">Quick Select Plugin</link>. The hotkey combination for each functionality can be changed via the Preferences dialog, under the "Global Hotkeys" tab. Under this tab, you will find a list of all features for which hotkeys can be configured. Use the <cmd>ctrl</cmd>, <cmd>alt</cmd>, and <cmd>shift</cmd> checkboxes to enable or disable these modifiers.
vi: Một số thành phần trong <app>Accerciser</app> có thể bật một số chức năng nhất định thông qua các phím nóng. Một ví dụ là <link xref="quick_select_plugin">Plugin Chọn nhanh</link>. Tổ hợp phím nóng cho mỗi chức năng có thể được thay đổi thông qua hộp thoại Tùy chọn, trong tab "Global Hotkeys" (Phím nóng Toàn cục). Dưới tab này, bạn sẽ tìm thấy một danh sách tất cả các tính năng mà phím nóng có thể được cấu hình. Sử dụng các hộp kiểm <cmd>ctrl</cmd>, <cmd>alt</cmd> và <cmd>shift</cmd> để bật hoặc tắt các bộ điều chỉnh này.

source: Configuring widget's highlighting
vi: Cấu hình tô sáng widget

source: Some of <app>Accerciser</app>'s elements, such as the global hotkey <keyseq><key>ctrl</key><key>alt</key><key>/</key></keyseq>, highlight a specific widget in a target application. The highlighting duration, border color, and fill color can be customized via the Preferences dialog, under the "Highlighting" tab.
vi: Một số thành phần của <app>Accerciser</app>, chẳng hạn như phím nóng toàn cục <keyseq><key>ctrl</key><key>alt</key><key>/</key></keyseq>, làm nổi bật một widget cụ thể trong một ứng dụng mục tiêu. Thời gian tô sáng, màu đường viền và màu tô có thể được tùy chỉnh thông qua hộp thoại Tùy chọn, trong tab "Highlighting" (Tô sáng).

# sort
source: 5. Quick Select Plugin
vi: 5. Plugin Chọn nhanh

source: Locating the object you need
vi: Tìm đối tượng bạn cần

source: Quick Select Plugin
vi: Plugin Chọn nhanh

source: The Quick Select Plugin does not provide a visible interface like the other default <app>Accerciser</app> plugins - instead, it adds facilities for quickly selecting items in the <link xref="desktop_tree_view">Application Tree View</link> via global hotkeys. Originally, these hotkeys were part of <app>Accerciser</app>'s core code, turning into the Quick Select Plugin later.
vi: Plugin Chọn nhanh không cung cấp giao diện trực quan như các plugin mặc định khác của <app>Accerciser</app> - thay vào đó, nó bổ sung các tiện ích để chọn nhanh các mục trong <link xref="desktop_tree_view">Ô xem cây ứng dụng</link> thông qua các phím nóng toàn cục. Ban đầu, các phím nóng này là một phần của mã cốt lõi của <app>Accerciser</app>, sau này trở thành Plugin Chọn nhanh.

source: The Quick Select Plugin provides two global hotkeys. Pressing <keyseq><key>ctrl</key><key>alt</key><key>a</key></keyseq> selects the last focused accessible widget in the Application Tree View. Pressing <keyseq><key>ctrl</key><key>alt</key><key>/</key></keyseq> selects the accessible widget under the pointer in the Application Tree View and highlights it in the target application.
vi: Plugin Chọn nhanh cung cấp hai phím nóng toàn cục. Nhấn <keyseq><key>ctrl</key><key>alt</key><key>a</key></keyseq> chọn widget có thể tiếp cận được được lấy nét (focus) gần nhất trong Ô xem cây ứng dụng. Nhấn <keyseq><key>ctrl</key><key>alt</key><key>/</key></keyseq> chọn widget có thể tiếp cận được dưới con trỏ trong Ô xem cây ứng dụng và tô sáng nó trong ứng dụng mục tiêu.

# sort
source: 3. Validator Default Plugin
vi: 3. Plugin Mặc định Bộ xác thực

source: Testing an application for accessibility
vi: Kiểm thử khả năng tiếp cận của một ứng dụng

source: AT-SPI Validator Plugin
vi: Plugin Bộ xác thực AT-SPI

source: The AT-SPI Validator Plugin generates a report with accessibility issues related to a target application. For each error, the report includes the severity level and a brief description.
vi: Plugin Bộ xác thực AT-SPI tạo một báo cáo với các vấn đề về khả năng tiếp cận liên quan đến một ứng dụng mục tiêu. Đối với mỗi lỗi, báo cáo bao gồm mức độ nghiêm trọng và mô tả ngắn gọn.

source: The AT-SPI Validator Plugin generates useful reports for verifying the accessibility of a target application.
vi: Plugin Bộ xác thực AT-SPI tạo các báo cáo hữu ích để xác minh khả năng tiếp cận của một ứng dụng mục tiêu.

# _
source: external ref='figures/validator_report.png' md5='0275b1c51e9f01c953cba87aee7b8764'
vi: tham chiếu ngoài='figures/validator_report.png'

source: Running the AT-SPI Validator Plugin
vi: Chạy Plugin Bộ xác thực AT-SPI

source: To run the AT-SPI Validator Plugin, select an item in the Application Tree View. The validator will generate the report with respect to the selected item and all of its descendant widgets in the tree hierarchy.
vi: Để chạy Plugin Bộ xác thực AT-SPI, hãy chọn một mục trong Ô xem cây ứng dụng. Bộ xác thực sẽ tạo báo cáo đối với mục đã chọn và tất cả các widget con cháu của nó trong hệ thống phân cấp cây.

source: After selecting an item, choose a validation schema in the combobox and press the <cmd>Validate</cmd> button to start generating the report. If you want to cancel the execution, just press the <cmd>Validate</cmd> button again.
vi: Sau khi chọn một mục, hãy chọn một lược đồ xác thực trong hộp tổ hợp và nhấn nút <cmd>Validate</cmd> (Xác thực) để bắt đầu tạo báo cáo. Nếu bạn muốn hủy thực thi, chỉ cần nhấn lại nút <cmd>Validate</cmd>.

source: The generated report is interactive. Therefore, you can double-click any error found to check which of the target application widgets is causing it. The corresponding widget will then appear selected in the <link xref="desktop_tree_view"> Application Tree View</link> and highlighted in the target application.
vi: Báo cáo được tạo ra là tương tác. Do đó, bạn có thể nhấp đúp vào bất kỳ lỗi nào được tìm thấy để kiểm tra widget nào của ứng dụng mục tiêu đang gây ra lỗi đó. Widget tương ứng sau đó sẽ xuất hiện được chọn trong <link xref="desktop_tree_view">Ô xem cây ứng dụng</link> và được tô sáng trong ứng dụng mục tiêu.

source: If you want to save the generated report in your system, just click the <cmd>Save</cmd> button. To clear the validation screen, press the <cmd>Clear</cmd> button.
vi: Nếu bạn muốn lưu báo cáo đã tạo vào hệ thống của mình, chỉ cần nhấp vào nút <cmd>Save</cmd> (Lưu). Để xóa màn hình xác thực, nhấn nút <cmd>Clear</cmd> (Xóa).

source: To get more information about an error in the generated report, make sure the corresponding item is selected and press the <cmd>Help</cmd> button. It will open a Help Page in your default browser.
vi: Để có thêm thông tin về một lỗi trong báo cáo đã tạo, hãy đảm bảo mục tương ứng đã được chọn và nhấn nút <cmd>Help</cmd> (Trợ giúp). Nó sẽ mở một Trang Trợ giúp trong trình duyệt mặc định của bạn.

source: Snip and pin useful information
de: Nützliche Informationen ausschneiden und anheften
es_es: Recortar y fijar información útil
fr: Découpez et épinglez des informations utiles
it: Cattura e appuntati informazioni utili
nl: Houd nuttige informatie in het zicht
pt_br: Recorte e fixe informações úteis
pt_pt: Recorte e fixe informações úteis
ru: Выделяйте и закрепляйте полезную информацию
uk: Вирізайте та закріплюйте корисну інформацію

source: screenshot;clipping;snip;image;pin;reference;
de: screenshot;clipping;snip;image;pin;reference;bildschirmfoto;ausschneiden;bild;anheften;referenz;
es_es: captura de pantalla;recorte;imagen;alfiler;referencia;
fr: capture d’écran;découpage;extrait;image;épingle;référence;
it: screenshot;ritaglio;cattura;immagine;pin;riferimento;

source: Clip what's important to a small floating window, so you don't have to switch between windows or workspaces repeatedly. The window can become miniaturized or have its opacity reduced, in order to do not block what's behind it.
de: Wichtiges ausschneiden und in einem kleinen schwebenden Fenster darstellen, sodass Sie nicht laufend zwischen Fenstern oder Arbeitsflächen wechseln müssen. Das Fenster kann als Miniatur oder durchsichtig dargestellt werden, sodass der Bildschirminhalt dahinter nicht verdeckt wird.
es_es: Recorta lo importante en una pequeña ventana flotante para no tener que cambiar entre ventanas o espacios de trabajo repetidamente. La ventana se puede miniaturizar o reducir su opacidad para no bloquear lo que hay detrás.
it: Ritaglia ciò che è importante in una piccola finestra mobile, così non dovrai passare ripetutamente da una finestra o da un'area di lavoro all'altra. La finestra può essere miniaturizzata o avere un'opacità ridotta, per non oscurare ciò che si trova dietro.
nl: Maak knipsels van belangrijke informatie en zet ze in een zwevend venster, zodat u niet continu een ander venster of werkblad hoeft te openen. Het venster kan worden geminimaliseerd of doorzichtig worden gemaakt, zodat u kunt u zien wat er achter het venster staat.
pt_pt: Recorte o que é importante numa pequena janela flutuante, para que não tenha de alternar entre janelas ou áreas de trabalho repetidamente. A janela pode ser miniaturizada ou ter a sua opacidade reduzida, para não bloquear o que está atrás dela.
ru: Закрепите всё важное в небольшом плавающем окне, чтобы не переключаться между окнами или рабочими пространствами. Окно может быть минимизировано или уменьшено его прозрачность, чтобы не блокировать то, что позади него.
uk: Вирізайте те, що важливо, у маленьке вікно, щоб не було потрібно постійно перемикатися між вікнами або робочими просторами. Вікно може бути мініатюризовано або його прозорість зменшена, щоб не блокувати те, що знаходиться позаду нього.

source: Best used with:
ar: يستحسن استخدام البرنامج مع:
de: Am besten nutzen Sie Kasasa mit:
es_es: Se utiliza mejor con:
it: Da utilizzare al meglio con:
nl: Aanbevolen:
pt_br: Melhor usado com:
pt_pt: Melhor utilizado com:
ru: Лучше использовать с:
uk: Краще використовувати з:

source: "Always on Top" and/or "Always on Visible Workspace"
ar: "دائمًا في الأعلى" و/أو "دائمًا في مساحة العمل المرئية"
de: »Immer im Vordergrund« und/oder »Immer auf der sichtbaren Arbeitsfläche«
es_es: "Siempre encima" y/o "Siempre en el área de trabajo visible"
fr: "Toujours au premier plan" et/ou "Toujours sur l'espace de travail visible"
it: "Sempre in primo piano" e/o "Area di lavoro sempre visibile"
nl: ‘Altijd bovenaan’ en/of ‘Altijd op zichtbaar werkblad’
pt_br: "Sempre na frente das outras janelas" e/ou "Sempre na área de trabalho visível"
pt_pt: "Sempre no topo" e/ou "Sempre na área de trabalho visível"
ru: "Всегда сверху" и/или "Всегда на видимом рабочем столе"
uk: "Завжди зверху" та/або "Завжди на видимому робочому просторі"

source: A keyboard shortcut
ar: أختصار لوحة المفاتيح
de: Einem Tastenkürzel
es_es: Un atajo de teclado
fr: Un raccourci clavier
it: Una scorciatoia da tastiera
nl: Een sneltoets
pt_br: Um atalho de teclado
pt_pt: Um atalho de teclado
ru: Клавиатурное сокращение
uk: Клавіатурне скорочення

source: On GNOME, go to Settings → Keyboard → View and Customize Shortcuts → Custom Shortcuts. There you can set a shortcut to run <code>flatpak run io.github.kelvinnovais.Kasasa</code>
de: In GNOME gehen Sie zu Einstellungen → Tastatur → Tastenkürzel anzeigen und anpassen → Eigene Tastenkürzel. Dort können Sie ein Tastenkürzel zum Ausführen von <code>flatpak run io.github.kelvinnovais.Kasasa</code> festlegen
es_es: En GNOME, vaya a Configuración → Teclado → Ver y personalizar atajos → Atajo personalizado. Allí puedes configurar un acceso directo para ejecutar flatpak run io.github.kelvinnovais.Kasasa
fr: Sur GNOME, allez dans Paramètres → Clavier → Voir et personnaliser les raccourcis → Raccourcis personnalisés. Vous pouvez y définir un raccourci pour exécuter <code>flatpak run io.github.kelvinnovais.Kasasa</code>
it: Su GNOME, vai su Impostazioni → Tastiera → Visualizza e personalizza scorciatoie → Scorciatoie personalizzate. Lì puoi impostare una scorciatoia per eseguire <code>flatpak run io.github.kelvinnovais.Kasasa</code>
nl: Op GNOME kan dat via Voorkeuren → Sneltoetsen → Sneltoetsen bekijken en aanpassen → Aangepaste sneltoetsen. Stel de sneltoets in voor flatpak run io.github.kelvinnovais.Kasasa
pt_br: No GNOME, vá para Configurações → Teclado → Visualizar e personalizar atalhos → Atalhos personalizados. Lá você pode definir um atalho para executar flatpak run io.github.kelvinnovais.Kasasa
pt_pt: No GNOME, aceda a Definições → Teclado → Vizualizar e personalizar atalhos → Atalhos personalizados. Lá você pode definir um atalho para executar flatpak run io.github.kelvinnovais.Kasasa
ru: В GNOME перейдите в Настройки → Клавиатура → Просмотр и изменение комбинаций клавиш → Дополнительные комбинации клавиш. Там вы сможете настроить сочетание для запуска <code>flatpak run io.github.kelvinnovais.Kasasa</code>
uk: У GNOME, перейдіть до Параметри → Клавіатура → Перегляд і налаштування скорочень → Власне скорочення. Там ви можете налаштувати скорочення, щоб запустити <em><code>flatpak run io.github.kelvinnovais.Kasasa</code></em>

source: Note: On GNOME versions < 46, a dialog will appear to set up and take the screenshot, instead of directly using the GNOME's screenshoter; this may be inconvenient.
de: Hinweis: Bei GNOME-Versionen < 46 erscheint ein Dialogfenster zum Einrichten und Erstellen des Bildschirmfotos, anstatt dass GNOMEs Bildschirmfotoanwendung direkt genutzt wird; dies ist möglicherweise etwas unkomfortabel.
es_es: Nota: En versiones de GNOME menores a 46, aparecerá un cuadro de diálogo para configurar y tomar la captura de pantalla, en lugar de usar directamente el generador de capturas de pantalla de GNOME; esto puede resultar inconveniente.
fr: Note: Sur les versions de GNOME < 46, une boîte de dialogue apparaîtra pour configurer et prendre la capture d’écran, au lieu d’utiliser directement le screenshoter de GNOME; cela peut être contraignant.
it: Nota: nelle versioni di GNOME < 46, verrà visualizzata una finestra di dialogo per impostare e acquisire lo screenshot, anziché utilizzare direttamente lo screenshoter di GNOME; questo potrebbe essere scomodo.
nl: Let op: op GNOME-versies ouder dan 46 wordt een venster getoond om de schermfoto te nemen in plaats van de foto direct te maken. Dit kan onhandig zijn.
pt_pt: Nota: Nas versões do GNOME < 46, irá aparecer uma caixa de diálogo para configurar e fazer a captura de ecrã, em vez de utilizar directamente a ferramenta de captura de ecrã do GNOME; isso pode ser inconveniente.
ru: Примечание: В GNOME <46 появится диалоговое окно для настройки и создания снимка экрана, вместо встроенного инструмента в GNOME; это может быть неудобно.
uk: Примітка: На GNOME версіях <46, діалогове вікно з'явиться щоб зробити знімок екрану, замість того, щоб напряму використовувати вбудований в GNOME додаток знімків екрану; це може бути не дуже зручно.

source: Main window
de: Hauptfenster
es_es: Ventana principal
fr: Fenêtre principale
it: Finestra principale
nl: Hoofdvenster
pt_pt: Janela principal
ru: Главное окно
uk: Головне вікно

source: Kasasa can become a window miniature
de: Kasasa lässt sich auch als Fensterminiatur anzeigen
es_es: Kasasa puede convertirse en una miniatura de ventana.
fr: Kasasa peut devenir une miniature de fenêtre
it: Kasasa può diventare una finestra in miniatura
nl: Kasasa kan een vensterminiatuur worden
pt_pt: Kasasa pode tornar-se uma miniatura de janela
ru: Окно Kasasa может быть минимизировано
uk: "Клаптик" може стати мініатюрним вікном

source: Or decrease its opacity
de: Oder durchsichtig darstellen
es_es: O disminuir su opacidad
fr: Ou réduire son opacité
it: Oppure diminuirne l'opacità
nl: Of de doorzichtigheid kan worden verlaagd
pt_pt: Ou diminuir a sua opacidade
ru: Или его прозрачность уменьшена
uk: Або зменшити його прозорість

# shortcut window
source: General
ar: عام
de: Allgemein
fr: Général
it: Generale
nl: Algemeen
pt_br: Geral
pt_pt: Geral
ru: Общие
uk: Загальні

# shortcut window
source: Show Shortcuts
ar: _مختصرات لوحة المفاتيح
de: Tastenkürzel anzeigen
es_es: Mostrar accesos directos
fr: Afficher les raccourcis
it: Mostra scorciatoie
nl: Sneltoetsen tonen
pt_br: _Mostrar atalhos de teclado
pt_pt: Mostrar atalhos
ru: Показать комбинации клавиш
uk: Показати клавіатурні скорочення

# shortcut window
source: Quit
ar: خروج
de: Beenden
es_es: Cerrar
fr: Quitter
it: Esci
nl: Afsluiten
pt_br: Sair
pt_pt: Sair
ru: Выход
uk: Вийти

source: Snip and pin useful information If you liked the app ❤️, consider giving it a star ⭐:
de: Nützliche Informationen ausschneiden und anheften Falls Sie diese Anwendung schätzen ❤️, mögen Sie ihr vielleicht einen Stern ⭐ verleihen:
es_es: Recorta y fija información útil Si te gustó la aplicación ❤️, considera darle una estrella ⭐:
fr: Découpez et épinglez des informations utiles Si vous aimez l’application ❤️, pensez à lui donner une étoile ⭐
it: Cattura e appuntati informazioni utili Se ti è piaciuta l'app ❤️, potresti darle una stella ⭐:
nl: Houd nuttige informatie in het zicht Als u de toepassing graag gebruikt ❤️, overweeg dan een ⭐ toe te kennen:
pt_br: Recorte e fixe informações úteis Se você gostou da aplicação ❤️, considere dar uma estrela ⭐:
pt_pt: Recorte e fixe informações úteis Se gostou da app ❤️, considere dar uma estrela ⭐:
ru: Выделяйте и закрепляйте полезную информацию Если вам понравилось приложение ❤️, поставьте звезду ⭐:
uk: Вирізайте та закріплюйте корисну інформацію Якщо вам сподобався додаток ❤️, подумайте над тим, щоб поставити йому зірку ⭐:

source: translator-credits
ar: Ronnie Nissan <ronnie.nissan@proton.me>
de: Uwe Senkler
es_es: Kelvin Ribeiro Novais
fr: crédits-de-traduction
it: Albano Battistella <albanobattistella@gmail.com>
nl: Heimen Stoffels <vistausss@fastmail.com>
pt_br: Kelvin Ribeiro Novais
pt_pt: Kelvin Ribeiro Novais
ru: Vladimir Kosolapov https://github.com/vmkspv freeducks-debug
uk: volkov <volkovissocool@gmail.com> freeducks-debug

source: Unblock miniaturization
de: Miniaturisierung erlauben
es_es: Desbloquear la miniaturización
fr: Débloquer la miniaturisation

source: Block miniaturization
de: Miniaturisierung verhindern
es_es: Bloquear la miniaturización
fr: Bloquer la miniaturisation

source: Trigger auto discard timer
de: Timer zum automatischen Verwerfen starten
es_es: Activar temporizador de descarte automático
fr: Déclencher le minuteur de suppression automatique
it: Attiva il timer di scarto automatico
nl: Automatisch wissen aan/uit
pt_br: Ativar temporizador de fechamento automático
pt_pt: Acionar temporizador de descarte automático
ru: Таймер автоматического сбрасывания
uk: Запустити таймер автоматичного видалення

source: Auto delete image when closing window
de: Bild bei Schließen des Fensters automatisch löschen
es_es: Eliminar imagen automáticamente al cerrar la ventana
fr: Supprimer automatiquement l'image à la fermeture de la fenêtre
it: Elimina automaticamente l'immagine quando si chiude la finestra
nl: Schermfoto automatisch wissen na sluiten van venster
pt_br: Excluir imagem automaticamente ao fechar a janela
pt_pt: Apagar imagem automaticamente ao fechar a janela
ru: Автоматическое удаление изображения при закрытии окна
uk: Автоматично видаляти зображення при закритті вікна

source: Menu
ar: القائمة
de: Menü
es_es: Menú
ru: Меню
uk: Меню
