Repository: KelvinNovais/Kasasa
Catalog: po/*.po
Languages: ar, de, es_es, fr, it, nl, pt_br, pt_pt, ru, uk, vi

source: class Clicker(ViewportPlugin): plugin_name = 'Clicker' plugin_description = 'Test the "click" action in relevant accessibles.'
vi: class Clicker(ViewportPlugin): plugin_name = 'Clicker' plugin_description = 'Kiểm tra hành động "nhấp" trong các đối tượng tiếp cận thích hợp.'

source: We override the init method with some UI building, and connecting a callback to a signal for the button. We set the alignment to allow the button to be centered in the plugin tab, and not monstrously take up the entire plugin space. Notice that the <cmd>plugin_area</cmd> instance variable contains a gtk.Frame that could be populated with all the plugin's widgets.
vi: Chúng ta ghi đè phương thức init với một số công việc xây dựng UI, và kết nối một callback tới một tín hiệu cho nút. Chúng ta thiết lập căn chỉnh để cho phép nút được căn giữa trong thẻ plugin, và không chiếm toàn bộ không gian plugin một cách kỳ cục. Lưu ý rằng biến instance <cmd>plugin_area</cmd> chứa một gtk.Frame có thể được điền với tất cả các widget của plugin.

source: def init(self): self.click_button = gtk.Button('Click me!') self.click_button.set_halign(gtk.Align.CENTER) self.click_button.set_valign(gtk.Align.CENTER) self.plugin_area.add(self.click_button) self.click_button.connect('clicked', self.onClick) self.show_all()
vi: def init(self): self.click_button = gtk.Button('Nhấp tôi đi!') self.click_button.set_halign(gtk.Align.CENTER) self.click_button.set_valign(gtk.Align.CENTER) self.plugin_area.add(self.click_button) self.click_button.connect('clicked', self.onClick) self.show_all()

source: We also created a convenience method that returns a list of supported actions of the currently selected accessible item - if it does not support the Action interface, it returns an empty list:
vi: Chúng ta cũng đã tạo một phương thức tiện lợi trả về danh sách các hành động được hỗ trợ của mục tiếp cận đang được chọn - nếu nó không hỗ trợ giao diện Action, nó trả về một danh sách rỗng:

source: The base plugin class has a method call onAccChanged that is called everytime the target application's selected accessible item changes. We will override it setting the button to be sensitive only when the current accessible item has the "click" action:
vi: Lớp plugin cơ sở có một phương thức gọi là onAccChanged được gọi mỗi khi mục tiếp cận được chọn của ứng dụng đích thay đổi. Chúng ta sẽ ghi đè nó, thiết lập nút chỉ nhạy (sensitive) khi mục tiếp cận hiện tại có hành động "click":

source: The callback method for button "clicked" performs the "click" action on the accessible item. Since this callback could only be called when the button is sensitive, we don't need to worry about checking if the current accessible has the "click" action?
vi: Phương thức callback cho sự kiện "clicked" của nút thực hiện hành động "click" trên mục tiếp cận. Vì callback này chỉ có thể được gọi khi nút đang nhạy, chúng ta không cần lo lắng về việc kiểm tra xem đối tượng tiếp cận hiện tại có hành động "click" hay không?

# link
source: Introduction to <app>Accerciser</app>
vi: Giới thiệu về <app>Accerciser</app>

source: <app>Accerciser</app>'s logo
vi: Logo của <app>Accerciser</app>

source: Before You Begin
vi: Trước khi bạn bắt đầu

source: Read the <link xref="help:gnome-help/a11y">Universal Access Help</link>
vi: Đọc <link xref="help:gnome-help/a11y">Trợ giúp Hỗ trợ truy cập</link>

source: Getting Started
vi: Bắt đầu

source: Examining the Accessibility of an Application
vi: Kiểm tra khả năng tiếp cận của một ứng dụng

source: Advanced Topics
vi: Các chủ đề nâng cao

# sort
source: 2. Interface Viewer Plugin
vi: 2. Plugin Bộ xem Giao diện

source: Examining your accessibility implementation
vi: Kiểm tra việc triển khai khả năng tiếp cận của bạn

source: Interface Viewer Plugin
vi: Plugin Bộ xem Giao diện

source: The Interface Viewer Plugin shows the information and controls provided by the AT-SPI interfaces present in each accessible item from the <link xref="desktop_tree_view">Application Tree View</link>. After selecting an item, you can use this plugin to quickly review its supported interfaces, to retrieve each interface's information, and to manipulate the item through all the interface’s methods.
vi: Plugin Bộ xem Giao diện hiển thị thông tin và điều khiển được cung cấp bởi các giao diện AT-SPI có trong mỗi mục tiếp cận từ <link xref="desktop_tree_view">Ô xem cây ứng dụng</link>. Sau khi chọn một mục, bạn có thể sử dụng plugin này để nhanh chóng xem xét các giao diện được hỗ trợ của nó, để truy xuất thông tin của từng giao diện và thao tác với mục thông qua tất cả các phương thức của giao diện.

source: Examining a Menu with the Interface Viewer Plugin
vi: Kiểm tra Menu bằng Plugin Bộ xem Giao diện

source: Given a selected item in the Application Tree View, all of its AT-SPI interfaces will be shown as sensitive in the Interface Viewer Plugin. Those unsupported will appear grayed out, such as the Application and Collection interfaces in the figure above.
vi: Với một mục được chọn trong Ô xem cây ứng dụng, tất cả các giao diện AT-SPI của nó sẽ được hiển thị là nhạy (sensitive) trong Plugin Bộ xem Giao diện. Những giao diện không được hỗ trợ sẽ xuất hiện màu xám, chẳng hạn như các giao diện Ứng dụng và Bộ sưu tập trong hình trên.

# _
source: external ref='figures/interface_viewer_plugin.png' md5='aed7e1cd60d381f408e087ab0ba28b4f'
vi: tham chiếu ngoài='figures/interface_viewer_plugin.png'

source: Running the Interface Viewer Plugin
vi: Chạy Plugin Bộ xem Giao diện

source: The first step to run the Interface Viewer Plugin is to select an item in the <link xref="desktop_tree_view"> Application Tree View</link>. After that, all AT-SPI interfaces covered by the plugin will be listed in the plugin's panel. The interfaces implemented by the selected item will be sensitive, so you can click each one of them to either retrieve their provided information or to interact with available methods. The following interfaces can be explored in <app>Accerciser</app>, assuming the selected item implements them:
vi: Bước đầu tiên để chạy Plugin Bộ xem Giao diện là chọn một mục trong <link xref="desktop_tree_view">Ô xem cây ứng dụng</link>. Sau đó, tất cả các giao diện AT-SPI được bao phủ bởi plugin sẽ được liệt kê trong bảng điều khiển của plugin. Các giao diện được mục đã chọn triển khai sẽ là nhạy (sensitive), vì vậy bạn có thể nhấp vào từng giao diện để truy xuất thông tin được cung cấp hoặc tương tác với các phương thức có sẵn. Các giao diện sau có thể được khám phá trong <app>Accerciser</app>, giả sử mục đã chọn triển khai chúng:

source: Accessible - This interface shows the selected item's child count (number of child widgets), description, states, relations, and attributes.
vi: Accessible (Tiếp cận được) - Giao diện này hiển thị số lượng con (số lượng widget con), mô tả, trạng thái, mối quan hệ và thuộc tính của mục đã chọn.

source: Action - This interface shows all the actions that can be performed by the selected item. For each interface, you will see its name, such as "press" or "click", followed by a description and a key binding, if there are any. If you select an action, a "Perform action" button will become sensitive. Press this button to see the item performing the selected action.
vi: Action (Hành động) - Giao diện này hiển thị tất cả các hành động có thể được thực hiện bởi mục đã chọn. Đối với mỗi hành động, bạn sẽ thấy tên của nó, chẳng hạn như "press" (nhấn) hoặc "click" (nhấp), tiếp theo là mô tả và một phím tắt (key binding), nếu có. Nếu bạn chọn một hành động, nút "Perform action" (Thực hiện hành động) sẽ trở nên nhạy. Nhấn nút này để xem mục thực hiện hành động đã chọn.

source: Application - This interface can be implemented by items with role "application". It is worth to point out that items with role "application" not necessarily implement this interface. If the selected item implements it, the interface will show its ID and, if there are any, its toolkit and version.
vi: Application (Ứng dụng) - Giao diện này có thể được triển khai bởi các mục có vai trò "application". Điều đáng lưu ý là các mục có vai trò "application" không nhất thiết phải triển khai giao diện này. Nếu mục đã chọn triển khai nó, giao diện sẽ hiển thị ID của nó và, nếu có, bộ công cụ và phiên bản của nó.

source: Component - This interface shows the selected item's absolute position (with respect to the desktop coordinate system), relative position (with respect to the window coordinate system), size, layer type, MDI-Z-order (a short integer indicating the stacking order of the component in the MDI layer), and alpha (if alpha blending is used).
vi: Component (Thành phần) - Giao diện này hiển thị vị trí tuyệt đối (đối với hệ tọa độ desktop), vị trí tương đối (đối với hệ tọa độ cửa sổ), kích thước, loại lớp (layer type), MDI-Z-order (một số nguyên ngắn chỉ thứ tự xếp chồng của thành phần trong lớp MDI) và alpha (nếu sử dụng pha trộn alpha) của mục đã chọn.

source: Document - This interface shows the selected item's document attributes and locale description, if there is one.
vi: Document (Tài liệu) - Giao diện này hiển thị các thuộc tính tài liệu và mô tả locale của mục đã chọn, nếu có.

source: Hypertext - This interface shows a list with all the selected item's hypertext hyperlinks. For each hyperlink, the interface provides its name, URI, start (the index in the hypertext at which the hyperlink begins) and end (the index in the hypertext at which this hyperlink ends).
vi: Hypertext (Siêu văn bản) - Giao diện này hiển thị một danh sách với tất cả các siêu liên kết (hyperlink) của mục siêu văn bản đã chọn. Đối với mỗi siêu liên kết, giao diện cung cấp tên, URI, start (chỉ mục trong siêu văn bản nơi siêu liên kết bắt đầu) và end (chỉ mục trong siêu văn bản nơi siêu liên kết kết thúc).

source: Image - This interface shows the selected item's description (or "no description" if unspecified), size, position (with respect to the desktop coordinate system), and locale, if there is one.
vi: Image (Hình ảnh) - Giao diện này hiển thị mô tả (hoặc "không có mô tả" nếu không được chỉ định), kích thước, vị trí (đối với hệ tọa độ desktop) và locale của mục đã chọn, nếu có.

source: Selection - This interface shows all selectable child items of the selected item. If the selected item is a menu bar with options "File", "Edit", "View", and "Help", and all of them are selectable, then they will be listed in this interface. If you click a listed option - "File", for example - and want to clear it, just press the "Clear" button below the list.
vi: Selection (Lựa chọn) - Giao diện này hiển thị tất cả các mục con có thể chọn của mục đã chọn. Nếu mục đã chọn là một thanh menu với các tùy chọn "File", "Edit", "View" và "Help", và tất cả chúng đều có thể chọn được, thì chúng sẽ được liệt kê trong giao diện này. Nếu bạn nhấp vào một tùy chọn được liệt kê - ví dụ: "File" - và muốn xóa nó, chỉ cần nhấn nút "Clear" (Xóa) bên dưới danh sách.

source: Streamable Content - This interface shows the selected item's content types and their corresponding URIs.
vi: Streamable Content (Nội dung có thể phát luồng) - Giao diện này hiển thị các loại nội dung của mục đã chọn và URI tương ứng của chúng.

source: Table - This interface shows the selected item's caption and summary, rows (number of rows), columns (number of columns), selected rows (number of selected rows), and selected columns (number of selected columns). For a selected cell, the interface shows its row's and column's header and extents.
vi: Table (Bảng) - Giao diện này hiển thị chú thích và tóm tắt, hàng (số hàng), cột (số cột), các hàng được chọn (số hàng được chọn) và các cột được chọn (số cột được chọn) của mục đã chọn. Đối với một ô đã chọn, giao diện hiển thị tiêu đề và phạm vi (extents) hàng và cột của nó.

source: TableCell - This interface shows the selected item's row and column index, row and column span, a list of the row and column header cells and the cell's table. By selecting a header cell in the list of row or column headers and pressing the "Show" button, it's possible to select that header cell object in Accerciser instead. Pressing the table button causes the table object to be selected.
vi: TableCell (Ô bảng) - Giao diện này hiển thị chỉ mục hàng và cột, phạm vi hàng và cột (row and column span), danh sách các ô tiêu đề hàng và cột và bảng của ô đó của mục đã chọn. Bằng cách chọn một ô tiêu đề trong danh sách tiêu đề hàng hoặc cột và nhấn nút "Show" (Hiển thị), có thể chọn đối tượng ô tiêu đề đó trong Accerciser thay thế. Nhấn nút bảng khiến đối tượng bảng được chọn.

source: Text - This interface shows the selected item's text content, that can be editable, and its attributes. The basic attributes are offset (the number of characters the text has) and justification. To see possible CSS attributes, click the "Include defaults" check box.
vi: Text (Văn bản) - Giao diện này hiển thị nội dung văn bản của mục đã chọn, có thể chỉnh sửa được và các thuộc tính của nó. Các thuộc tính cơ bản là offset (số lượng ký tự văn bản có) và căn chỉnh (justification). Để xem các thuộc tính CSS có thể có, hãy nhấp vào hộp kiểm "Include defaults" (Bao gồm mặc định).

source: Value - This interface shows the selected item's current value, minimum allowed value, maximum allowed value, and the minimum increment by which the value may be changed (or zero if this value cannot be determined). The current value can be manually changed via a spin button.
vi: Value (Giá trị) - Giao diện này hiển thị giá trị hiện tại, giá trị tối thiểu được phép, giá trị tối đa được phép và mức tăng tối thiểu mà giá trị có thể được thay đổi (hoặc bằng không nếu giá trị này không thể được xác định) của mục đã chọn. Giá trị hiện tại có thể được thay đổi thủ công thông qua một nút xoay (spin button).

# sort
source: 1. What is Accerciser?
vi: 1. Accerciser là gì?

source: An interactive accessibility explorer
vi: Một công cụ khám phá khả năng tiếp cận tương tác

source: What is <app>Accerciser</app>?
vi: <app>Accerciser</app> là gì?

source: <app>Accerciser</app> is an interactive Python accessibility explorer. It uses the AT-SPI library to inspect, examine, and interact with widgets, allowing you to check if an application is providing correct information to assistive technologies and automated testing frameworks. <app>Accerciser</app> comes with a set of plugins that you can use to create custom views of accessibility information.
vi: <app>Accerciser</app> là một công cụ khám phá khả năng tiếp cận Python tương tác. Nó sử dụng thư viện AT-SPI để kiểm tra, xem xét và tương tác với các widget, cho phép bạn kiểm tra xem một ứng dụng có đang cung cấp thông tin chính xác cho các công nghệ hỗ trợ và các khuôn khổ kiểm thử tự động hay không. <app>Accerciser</app> đi kèm với một bộ plugin mà bạn có thể sử dụng để tạo các chế độ xem tùy chỉnh về thông tin khả năng tiếp cận.

source: By default, <app>Accerciser</app>'s main interface is comprised of three sections: a tree view of the entire desktop accessible hierarchy, namely <link xref="desktop_tree_view"> Application Tree View</link>, and two plugin areas. If you prefer to see all plugins in a single area, dividing <app>Accerciser</app>'s interface in two sections instead of three, press <keyseq><key>ctrl </key><key>t</key></keyseq>. To re-divide it in three sections, press <keyseq><key>ctrl</key><key>t</key></keyseq> again.
vi: Theo mặc định, giao diện chính của <app>Accerciser</app> bao gồm ba phần: một chế độ xem cây của toàn bộ hệ thống phân cấp tiếp cận được của máy tính, cụ thể là <link xref="desktop_tree_view">Ô xem cây ứng dụng</link>, và hai khu vực plugin. Nếu bạn muốn xem tất cả các plugin trong một khu vực duy nhất, chia giao diện của <app>Accerciser</app> thành hai phần thay vì ba, hãy nhấn <keyseq><key>ctrl </key><key>t</key></keyseq>. Để chia lại thành ba phần, hãy nhấn <keyseq><key>ctrl</key><key>t</key></keyseq> lần nữa.

source: Make sure that accessibility support is enabled in your desktop - otherwise, <app>Accerciser</app> will not work as expected.
vi: Đảm bảo rằng hỗ trợ khả năng tiếp cận đã được bật trong desktop của bạn - nếu không, <app>Accerciser</app> sẽ không hoạt động như mong đợi.

source: <app>Accerciser</app>'s default interface.
vi: Giao diện mặc định của <app>Accerciser</app>.

# _
source: external ref='figures/accerciser-view.png' md5='87ef1d7587097a04dd784e14840f3115'
vi: tham chiếu ngoài='figures/accerciser-view.png'md5='87ef1d7587097a04dd784e14840f3115'

source: <app>Accerciser</app>'s intended audience
vi: Đối tượng mục tiêu của <app>Accerciser</app>

source: <app>Accerciser</app> fits the needs of many different audiences. User interface developers use it to ensure that their applications are providing all of their features through AT-SPI. Assistive technology developers are able to see what AT-SPI is providing to their applications. Automated UI test developers find <app>Accerciser</app> beneficial since it exposes different events that could be expected from their target application.
vi: <app>Accerciser</app> phù hợp với nhu cầu của nhiều đối tượng khác nhau. Các nhà phát triển giao diện người dùng sử dụng nó để đảm bảo rằng các ứng dụng của họ đang cung cấp tất cả các tính năng thông qua AT-SPI. Các nhà phát triển công nghệ hỗ trợ có thể xem những gì AT-SPI đang cung cấp cho các ứng dụng của họ. Các nhà phát triển kiểm thử UI tự động thấy <app>Accerciser</app> hữu ích vì nó phơi bày các sự kiện khác nhau có thể được mong đợi từ ứng dụng mục tiêu của họ.

source: <app>Accerciser</app>'s plugin architecture
vi: Kiến trúc plugin của <app>Accerciser</app>

source: <app>Accerciser</app> has an extensible, plugin-based architecture. Its core code is fairly small and most of its features are part of default plugins:
vi: <app>Accerciser</app> có kiến trúc dựa trên plugin, có thể mở rộng. Mã cốt lõi của nó khá nhỏ và hầu hết các tính năng của nó là một phần của các plugin mặc định:

source: <link xref="interface_viewer_plugin">Interface Viewer</link> - A plugin that lets you explore the AT-SPI interfaces provided by each accessible widget of a target application.
vi: <link xref="interface_viewer_plugin">Bộ xem Giao diện</link> - Một plugin cho phép bạn khám phá các giao diện AT-SPI được cung cấp bởi mỗi widget có thể tiếp cận được của một ứng dụng mục tiêu.

source: <link xref="validator_plugin">AT-SPI Validator</link> - A plugin that applies tests to verify the accessibility of a target application.
vi: <link xref="validator_plugin">Bộ xác thực AT-SPI</link> - Một plugin áp dụng các kiểm thử để xác minh khả năng tiếp cận của một ứng dụng mục tiêu.

source: <link xref="event_monitor_plugin">Event Monitor</link> - A plugin that displays AT-SPI events emitted by a target application as they occur.
vi: <link xref="event_monitor_plugin">Bộ giám sát Sự kiện</link> - Một plugin hiển thị các sự kiện AT-SPI được phát ra bởi một ứng dụng mục tiêu khi chúng xảy ra.

source: <link xref="quick_select_plugin">Quick Select</link> - A plugin that provides global hotkeys for quickly selecting accessible widgets in <app>Accerciser</app>'s Application Tree View.
vi: <link xref="quick_select_plugin">Chọn nhanh</link> - Một plugin cung cấp các phím nóng toàn cục để chọn nhanh các widget có thể tiếp cận được trong Ô xem cây ứng dụng của <app>Accerciser</app>.

source: <link xref="api_browser_plugin">API Browser</link> - A plugin that shows the interfaces, methods, and attributes available on each accessible widget of a target application.
vi: <link xref="api_browser_plugin">Trình duyệt API</link> - Một plugin hiển thị các giao diện, phương thức và thuộc tính có sẵn trên mỗi widget có thể tiếp cận được của một ứng dụng mục tiêu.

source: <link xref="ipython_plugin">IPython Console</link> - A plugin that provides a full, interactive Python shell with access to selected accessible widgets of a target application.
vi: <link xref="ipython_plugin">Bảng điều khiển IPython</link> - Một plugin cung cấp một shell Python tương tác, đầy đủ với quyền truy cập vào các widget có thể tiếp cận được đã chọn của một ứng dụng mục tiêu.

source: More about Accessibility
vi: Thêm về Khả năng tiếp cận

source: Accessibility is a core value that should touch all aspects of a Desktop Environment. To help achieve it in GNOME, some libraries were developed, such as ATK and AT-SPI. Though originated in GNOME, these libraries are now also used in other Desktop Environments. To learn more about Accessibility Libraries for GNU/UNIX systems, you can consult:
vi: Khả năng tiếp cận là một giá trị cốt lõi nên chạm đến mọi khía cạnh của Môi trường Desktop. Để giúp đạt được điều đó trong GNOME, một số thư viện đã được phát triển, chẳng hạn như ATK và AT-SPI. Mặc dù có nguồn gốc từ GNOME, các thư viện này hiện cũng được sử dụng trong các Môi trường Desktop khác. Để tìm hiểu thêm về Thư viện Khả năng tiếp cận cho các hệ thống GNU/UNIX, bạn có thể tham khảo:

source: <link href="http://developer.gnome.org/atk/">ATK Accessibility Toolkit</link> - ATK provides the set of accessibility interfaces that are implemented by other toolkits and applications. Using the ATK interfaces, accessibility tools have full access to view and control running applications.
vi: <link href="http://developer.gnome.org/atk/">Bộ công cụ Khả năng tiếp cận ATK</link> - ATK cung cấp tập hợp các giao diện khả năng tiếp cận được triển khai bởi các bộ công cụ và ứng dụng khác. Sử dụng các giao diện ATK, các công cụ hỗ trợ khả năng tiếp cận có toàn quyền truy cập để xem và điều khiển các ứng dụng đang chạy.

source: <link href="http://developer.gnome.org/at-spi-cspi/stable/">AT-SPI</link> - AT-SPI is the primary service interface by which assistive technologies query and receive notifications from running applications. Additional material is available from the <link href="http://accessibility.kde.org/developer/atk.php#coreclasses">KDE Accessibility Development Community</link>.
vi: <link href="http://developer.gnome.org/at-spi-cspi/stable/">AT-SPI</link> - AT-SPI là giao diện dịch vụ chính mà qua đó các công nghệ hỗ trợ truy vấn và nhận thông báo từ các ứng dụng đang chạy. Tài liệu bổ sung có sẵn từ <link href="http://accessibility.kde.org/developer/atk.php#coreclasses">Cộng đồng Phát triển Khả năng tiếp cận KDE</link>.

source: <link href="https://help.gnome.org/users/gnome-help/stable/a11y.html">GNOME Desktop Accessibility Guide</link> - A guide for anyone interested in how the GNOME Desktop supports the needs of users with disabilities.
vi: <link href="https://help.gnome.org/users/gnome-help/stable/a11y.html">Hướng dẫn Khả năng tiếp cận Desktop GNOME</link> - Một hướng dẫn cho bất kỳ ai quan tâm đến cách Desktop GNOME hỗ trợ nhu cầu của người dùng khuyết tật.

source: <link href="http://developer.gnome.org/accessibility-devel-guide/stable/">GNOME Accessibility Developer's Guide</link> - A guide for developers who want to ensure their applications are accessible to the widest audience of users.
vi: <link href="http://developer.gnome.org/accessibility-devel-guide/stable/">Hướng dẫn dành cho Nhà phát triển Khả năng tiếp cận GNOME</link> - Một hướng dẫn cho các nhà phát triển muốn đảm bảo các ứng dụng của họ có thể tiếp cận được với lượng người dùng rộng nhất.

source: <link href="https://wiki.gnome.org/Accessibility">GNOME Accessibility Project</link> - The GNOME Accessibility Project includes the guides listed above along with many other useful links for users, developers and system administrators.
vi: <link href="https://wiki.gnome.org/Accessibility">Dự án Khả năng tiếp cận GNOME</link> - Dự án Khả năng tiếp cận GNOME bao gồm các hướng dẫn được liệt kê ở trên cùng với nhiều liên kết hữu ích khác cho người dùng, nhà phát triển và quản trị viên hệ thống.

# sort
source: 2. IPython Plugin
vi: 2. Plugin IPython

source: When all else fails
vi: Khi mọi thứ khác thất bại

source: IPython Console Plugin
vi: Plugin Bảng điều khiển IPython
