Repository: KelvinNovais/Kasasa
Catalog: po/*.po
Languages: ar, de, es_es, fr, it, nl, pt_br, pt_pt, ru, uk, vi

source: _Preferences
ar: الا_عدادات
de: _Einstellungen
es_es: _Preferencias
fr: _Préférences
it: _Preferenze
nl: _Voorkeuren
pt_br: _Preferências
pt_pt: _Preferências
ru: _Параметры
uk: _Налаштування

source: _About Kasasa
ar: حول _Kasasa
de: _Info zu Kasasa
es_es: _Acerca de Kasasa
fr: _À propos de Kasasa
it: _Informazioni su Kasasa
nl: Over K_asasa
pt_br: _Sobre Kasasa
pt_pt: _Sobre Kasassa
ru: _О приложении
uk: _Про Клаптик

source: Error: %s
de: Fehler: %s
fr: Erreur : %s
it: Errore: %s
nl: Foutmelding: %s
pt_br: Erro: %s
pt_pt: Erro: %s
ru: Ошибка: %s
uk: Помилка: %s

source: Copy
ar: أنسخ
de: Kopie
es_es: Copiar
fr: Copier
it: Copia
nl: Kopiëren
pt_br: Copiar
pt_pt: Copiar
ru: Копировать
uk: Скопіювати

source: Couldn't load the screenshot
de: Der Screenshot konnte nicht geladen werden
es_es: No se pudo cargar la captura de pantalla
fr: Impossible de charger la capture d'écran
it: Impossibile caricare lo screenshot
nl: De schermfoto kan niet worden geladen
pt_br: Não foi possível carregar a captura de tela
pt_pt: Não foi possível carregar a captura de ecrã
ru: Не удалось загрузить снимок экрана
uk: Не вдалося завантажити знімок екрану

source: Reason:
de: Grund:
es_es: Razón:
fr: Raison :
it: Motivo:
nl: Reden:
pt_br: Motivo:
pt_pt: Razão:
ru: Причина:

source: Screenshot failed
de: Bildschirmfoto fehlgeschlagen
es_es: Error en la captura de pantalla
fr: Échec de la capture d'écran
it: Screenshot non riuscito
nl: Schermfoto mislukt
pt_br: Captura de tela falhou
pt_pt: Falha na captura de ecrã
ru: Не удалось сделать снимок экрана

source: Copied to the clipboard
de: In die Zwischenablage kopiert
es_es: Copiado al portapapeles
fr: Copié dans le presse-papiers
it: Copiato negli appunti
nl: Gekopieerd naar het klembord
pt_br: Copiado para área de transferência
pt_pt: Copiado para a área de transferência
ru: Скопировано в буфер обмена
uk: Скопійовано до буферу обміну

source: Add screenshot
de: Bildschirmfoto hinzufügen
es_es: Agregar captura de pantalla
fr: Ajouter une capture d'écran
it: Aggiungi screenshot
nl: Schermfoto toevoegen
pt_pt: Adicionar captura de ecrã
ru: Добавить снимок экрана
uk: Додати знімок екрану

source: More actions
de: Weitere Aktionen
es_es: Más acciones
fr: Plus d'actions

source: Delayed screenshot
de: Verzögertes Bildschirmfoto
es_es: Captura de pantalla con retraso
fr: Capture d'écran différée

source: Remove this item
de: Diesea Objekt entfernen
es_es: Eliminar este artículo
fr: Supprimer cet élément

source: Retake screenshot
ar: إعادة أخذ لقطة الشاشة
de: Bildschirmfoto erneut aufnehmen
es_es: Volver a tomar captura de pantalla
fr: Reprendre la capture d'écran
it: Acquisisci nuovamente lo screenshot
nl: Schermfoto opnieuw maken
pt_br: Refazer captura de tela
pt_pt: Refazer captura de ecrã
ru: Повторить снимок экрана
uk: Ще раз зробити знімок екрану

source: Copy screenshot
de: Bildschirmfoto kopieren
es_es: Copiar captura de pantalla
fr: Copier la capture d'écran
it: Copia screenshot
nl: Schermfoto kopiëren
pt_pt: Copiar captura de ecrã
ru: Скопировать снимок экрана
uk: Скопіювати знімок екрану

source: Screencast ended with error
de: Screencast mit Fehler
es_es: La screencast terminó con un error
fr: La capture d'écran vidéo s'est terminée avec une erreur

source: No screencast
de: Kein Screencast
es_es: Sin screencast
fr: Aucune capture d'écran vidéo

source: Window hide mode
de: Fenster-Ausblendmodus
es_es: Modo ocultar ventana
fr: Mode de masquage de la fenêtre
nl: Venster verbergen-modus
pt_pt: Modo de ocultação de janela
ru: Режим скрытия окна
uk: Режим ховання вікна

source: Decrease opacity
de: Deckkraft verringern
es_es: Disminuir la opacidad
fr: Réduire l'opacité
it: Diminuire l'opacità
nl: Dekking verminderen
pt_pt: Diminuir a opacidade
ru: Уменьшение непрозрачности
uk: Зменшити прозорість

source: Opacity level
ar: درجة التعميم
de: Deckkraft
es_es: Nivel de opacidad
fr: Niveau d'opacité
it: Livello di opacità
nl: Doorzichtigheidsniveau
pt_br: Nível de opacidade
pt_pt: Nível de opacidade
ru: Уровень непрозрачности
uk: Рівень непрозорості

source: Miniaturize
de: Miniaturisieren
es_es: Miniaturizar
fr: Miniaturiser
it: Miniaturizzare
nl: Miniaturiseren
pt_pt: Miniaturizar
ru: Минимизировать
uk: Мініатюрувати

source: Auto hide the header bar
de: Titelleiste automatisch ausblenden
es_es: Ocultar automáticamente la barra de encabezado
fr: Masquer automatiquement la barre d'en-tête
it: Nascondi automaticamente la barra dell'intestazione
nl: Kopbalk automatisch verbergen
pt_br: Ocultar automaticamente a barra de título
pt_pt: Ocultar automaticamente a barra de cabeçalho
ru: Автоматическое скрытие панели заголовка
uk: Автоматично ховати заголовок

source: Controls timeout (in seconds)
de: Zeitlimit festlegen (in Sekunden)
es_es: Controla el tiempo de ocultación (en segundos)
fr: Délai d'expiration des commandes (en secondes)

source: Occupying screen percentage
de: Belegter Anteil der Bildschirmfläche
es_es: Porcentaje de pantalla ocupada
fr: Pourcentage d’occupation de l'écran
it: Percentuale di occupazione dello schermo
nl: Schermgebruik
pt_br: Porcentagem de tela ocupada
pt_pt: Percentagem de ecrã ocupada
ru: Процент занимаемого экрана
uk: Процент займання екрану

source: Max percentage of the screen that Kasasa can use
de: Maximal von Kasasa verwendeter Anteil der Bildschirmfläche
es_es: Porcentaje máximo de la pantalla que Kasasa puede usar
fr: Pourcentage maximal de l'écran que Kasasa peut utiliser
it: Percentuale massima dello schermo che Kasasa può utilizzare
nl: Het maximale schermpercentage dat Kasasa mag gebruiken
pt_br: Porcentagem máxima da tela que o Kasasa pode usar
pt_pt: Percentagem máxima do ecrã que o Kasasa pode usar
ru: Максимальный процент экрана, который может использовать Kasasa
uk: Максимальний процент екрану, який "Клаптик" може займати

source: Auto close window
de: Fenster automatisch schließen
es_es: Cerrar ventana automáticamente
fr: Fermer automatiquement la fenêtre
it: Chiusura automatica della finestra
nl: Venster automatisch sluiten
pt_br: Fechar janela automaticamente
pt_pt: Fechar janela automaticamente
ru: Автоматическое закрытие окна
uk: Автоматично закривати вікно

source: Auto close the window after a certain time
de: Fenster nach Ablauf einer bestimmten Zeit automatisch schließen
es_es: Cerrar automáticamente la ventana después de un tiempo determinado
fr: Fermer automatiquement la fenêtre après un certain délai
it: Chiusura automatica della finestra dopo un certo tempo
nl: Sluit het venster na een bepaalde tijdspanne
pt_br: Fechar janela automaticamente após certo tempo
pt_pt: Fechar automaticamente a janela após um determinado tempo
ru: Автоматическое закрытие окна через определённое время
uk: Автоматично закривати вікно після певного часу

source: Time (in minutes)
de: Zeit (in Minuten)
es_es: Tiempo (en minutos)
fr: Temps (en minutes)
it: Tempo (in minuti)
nl: Tijdspanne (in minuten)
pt_br: Tempo (em minutos)
pt_pt: Tempo (em minutos)
ru: Время (в минутах)
uk: Час (у хвилинах)

source: Screenshot delay (in seconds)
de: Bildschirmfotoverzögerung (in Sekunden)
es_es: Retraso de captura de pantalla (en segundos)
fr: Délai de capture d'écran (en secondes)

source: Time for delayed screenshots
de: Zeit für verzögerte Bildschirmfotoa
es_es: Tiempo para tomar capturas de pantalla retrasadas
fr: Durée avant la capture d'écran différée

source: Auto delete image
de: Bild automatisch löschen
es_es: Eliminar imagen automáticamente
fr: Supprimer automatiquement l'image
it: Elimina automaticamente l'immagine
nl: Schermfoto automatisch verwijderen
pt_br: Auto deletar a imagem
pt_pt: Apagar automaticamente a imagem
ru: Автоматическое удаление изображения
uk: Автоматично видаляти зображення

source: Auto delete the image when closing the window or retaking a screenshot
de: Bild automatisch löschen, sobald das Fenster geschlossen oder erneut ein Bildschirmfoto erstellt wird
es_es: Eliminar automáticamente la imagen al cerrar la ventana o volver a tomar una captura de pantalla
fr: Supprimer automatiquement l"image lors de la fermeture de la fenêtre ou lors d'une nouvelle capture d'écran
it: Elimina automaticamente l'immagine quando si chiude la finestra o si esegue nuovamente uno screenshot
nl: Verwijder de schermfoto na het sluiten van het venster of het opnieuw maken ervan
pt_br: Excluir automaticamente a imagem ao fechar a janela ou ao tirar uma nova captura de tela
pt_pt: Apagar automaticamente a imagem ao fechar a janela ou refazer uma captura de ecrã
ru: Автоматическое удаление изображения при закрытии окна или повторном снимке экрана
uk: Автоматично видаляти зображення при закриванні вікна або створенні нового знімка екрану

source: Screencast
fr: Capture d'écran vidéo

source: screenshot;clipping;snip;image;
pt_br: captura de tela;recorte;recortar;imagem;
pt_pt: captura de ecrã;recorte;imagem;

source: Remove screenshot
it: Rimuovi screenshot
pt_pt: Remover captura de ecrã

source: Kasasa
uk: Клаптик

source: Clip what's important to a small floating window, so you don't have to switch between windows or workspaces repeatedly. The application allows you to see what's behind the window by hovering over it.
pt_br: Recorte o que é importante para uma pequena janela flutuante, para não ter que alternar entre janelas ou áreas de trabalho repetidamente. O aplicativo permite que você veja o que está atrás da janela passando o mouse sobre ela.

source: Note: On GNOME versions &lt; 46, a dialog will appear to set up and take the screenshot, instead of directly using the GNOME's screenshoter; this may be inconvenient.
ar: ملاحظة: في إصدارات GNOME أقل من 46، ستظهر نافذة حوار لإعداد وأخذ لقطة الشاشة، بدلاً من استخدام أداة لقطة الشاشة الخاصة بـ GNOME مباشرةً؛ قد يكون ذلك غير مريح.
pt_br: Nota: Nas versões GNOME &lt; 46, uma caixa de diálogo aparecerá para configurar e fazer a captura de tela, em vez de usar diretamente o criador de capturas de tela do GNOME; isso pode ser inconveniente.

source: A small window, in dark mode
ar: نافذة صغيرة، في وضعية الوضع الداكن
pt_br: Pequena janela, em modo escuro

source: A small window, in light mode
ar: نافذة صغيرة، في وضعية الوضع الفاتح
pt_br: Pequena janela, em modo claro

source: Kasasa over another application
ar: تطبيق Kasasa فوق تطبيق أخر
pt_br: Kasasa sobre outra aplicação

source: Kasasa over another application, with opacity decreased
ar: تطبيق Kasasa فوق تطبيق أخر, مع تقليل الشفافية
pt_br: Kasasa sobre outra aplicação, com opacidade reduzida

source: Change opacity
ar: تغيير التعتيم
pt_br: Mudar opacidade

source: Error
ar: خطء

source: Ensure Screenshot permission is enabled in Settings → Apps → Kasasa
ar: تأكد من تمكين إذن لقطات الشاشة في الإعدادات → التطبيقات → Kasasa

source: Error:
ar: خطء:

source: _Keyboard Shortcuts
ar: _مختصرات لوحة المفاتيح

source: Create ephemeral floating screenshot windows
ar: إنشاء نوافذ عائمة، مؤقتة للقطة الشاشة
