Repository: KelvinNovais/Kasasa
Catalog: po/*.po
Languages: ar, de, es_es, fr, it, nl, pt_br, pt_pt, ru, uk, vi

# _
source: translator-credits
vi: Vietnam Linux L10n <https://github.com/linux-l10n-vi> Loc Huynh <https://github.com/hthienloc>

# sort
source: 1. API Browser Plugin
vi: 1. Plugin Trình duyệt API

source: Verifying interfaces, methods, and properties
vi: Xác minh các giao diện, phương thức và thuộc tính

source: API Browser Plugin
vi: Plugin Trình duyệt API

source: Given an accessible widget selected in the <link xref="desktop_tree_view">Application Tree View</link>, the API Browser Plugin shows its implemented AT-SPI interfaces along with its methods and properties.
vi: Với một widget tiếp cận được chọn trong <link xref="desktop_tree_view">Ô xem cây ứng dụng</link>, Plugin Trình duyệt API hiển thị các giao diện AT-SPI đã cài đặt của nó cùng với các phương thức và thuộc tính.

source: The API Browser Plugin allows you to verify interfaces, methods, and properties of a target accessible widget in an application.
vi: Plugin Trình duyệt API cho phép bạn xác minh các giao diện, phương thức và thuộc tính của một widget tiếp cận đích trong một ứng dụng.

source: Running the API Browser Plugin
vi: Chạy Plugin Trình duyệt API

source: To run the API Browser Plugin, select an accessible widget in the Application Tree View. Double-clicking a widget highlights it in the application's interface, so you can be sure whether a certain widget were the one you were looking for.
vi: Để chạy Plugin Trình duyệt API, chọn một widget tiếp cận trong Ô xem cây ứng dụng. Nhấn đúp vào một widget sẽ tô sáng nó trong giao diện của ứng dụng, để bạn có thể chắc chắn liệu widget đó có phải là cái bạn đang tìm hay không.

source: After that, select one of the widget's interfaces in the combobox. All public methods of the selected interface will be listed in the plugin's leftmost column. All public properties, with their corresponding values, will be listed in the plugin's rightmost column.
vi: Sau đó, chọn một trong các giao diện của widget trong hộp chọn. Tất cả các phương thức công khai của giao diện đã chọn sẽ được liệt kê trong cột ngoài cùng bên trái của plugin. Tất cả các thuộc tính công khai, với các giá trị tương ứng của chúng, sẽ được liệt kê trong cột ngoài cùng bên phải của plugin.

source: By default, the API Browser Plugin hides private methods and properties. To see them listed, unselect the checkbox <cmd>Hide Private Attributes</cmd>. To hide them again, re-select this checkbox.
vi: Theo mặc định, Plugin Trình duyệt API ẩn các phương thức và thuộc tính riêng tư. Để xem chúng được liệt kê, bỏ chọn hộp kiểm <cmd>Hide Private Attributes</cmd>. Để ẩn lại chúng, chọn lại hộp kiểm này.

# sort
source: 1. Application Tree View
vi: 1. Ô xem cây ứng dụng

source: Exploring the accessible hierarchy of the desktop
vi: Khám phá phân cấp tiếp cận của màn hình làm việc

source: Application Tree View
vi: Ô xem cây ứng dụng

source: <app>Accerciser</app>'s interface contains a tree view, namely Application Tree View, that covers all accessible applications currently running on the desktop. To create this tree view, <app>Accerciser</app> uses the AT-SPI's registry daemon. This daemon is responsible for keeping track of all the accessible applications on the desktop and forwarding X events over the AT-SPI D-Bus. After getting all accessible applications, <app>Accerciser</app> represents each one of them as a hierarchical structure with expanding nodes.
vi: Giao diện của <app>Accerciser</app> chứa một ô xem cây, cụ thể là Ô xem cây ứng dụng, bao gồm tất cả các ứng dụng tiếp cận hiện đang chạy trên màn hình làm việc. Để tạo ô xem cây này, <app>Accerciser</app> sử dụng trình nền đăng ký của AT-SPI. Trình nền này chịu trách nhiệm theo dõi tất cả các ứng dụng tiếp cận trên màn hình làm việc và chuyển tiếp các sự kiện X qua D-Bus AT-SPI. Sau khi nhận được tất cả các ứng dụng tiếp cận, <app>Accerciser</app> biểu diễn từng ứng dụng dưới dạng cấu trúc phân cấp với các nút mở rộng.

source: <app>Accerciser</app>'s Application Tree View represents the interface of each accessible application running on the desktop as a widget hierarchical structure.
vi: Ô xem cây ứng dụng của <app>Accerciser</app> biểu diễn giao diện của mỗi ứng dụng tiếp cận đang chạy trên màn hình làm việc dưới dạng cấu trúc phân cấp widget.

source: The first node of each application represented in this tree view is the application itself. When you expand a node, you can see all of its child widgets, which allows a hierarchical view of the application's interface. For each node, <app>Accerciser</app> provides some basic information, such as its name, role and number of children.
vi: Nút đầu tiên của mỗi ứng dụng được biểu diễn trong ô xem cây này là chính ứng dụng đó. Khi bạn mở rộng một nút, bạn có thể thấy tất cả các widget con của nó, cho phép có cái nhìn phân cấp về giao diện của ứng dụng. Đối với mỗi nút, <app>Accerciser</app> cung cấp một số thông tin cơ bản, chẳng hạn như tên, vai trò và số lượng con.

source: Be aware that nodes with many children take a long time to expand.
vi: Lưu ý rằng các nút có nhiều con sẽ mất nhiều thời gian để mở rộng.

source: Bookmarking items in the Application Tree View
vi: Đánh dấu các mục trong Ô xem cây ứng dụng

source: <app>Accerciser</app> allows bookmarking items in the Application Tree View for later examining. This is helpful when the target application must be restarted - after rebuilding it, for example. To bookmark an item, select it and do <guiseq><gui>Bookmarks</gui><gui>Add Bookmark</gui></guiseq> or press <keyseq><key>Ctrl</key><key>d</key></keyseq>.
vi: <app>Accerciser</app> cho phép đánh dấu các mục trong Ô xem cây ứng dụng để kiểm tra sau. Điều này hữu ích khi ứng dụng đích phải được khởi động lại - ví dụ sau khi xây dựng lại nó. Để đánh dấu một mục, chọn nó và thực hiện <guiseq><gui>Bookmarks</gui><gui>Add Bookmark</gui></guiseq> hoặc nhấn <keyseq><key>Ctrl</key><key>d</key></keyseq>.

source: Bookmarks to accessible items in <app>Accerciser</app> are defined by an application name and a "path" in the application's internal accessible hierarchy to the bookmarked accessible. When the target application is in a different state - i.e. multiple top level frames -, the path might not be correct. Bookmarks could be managed by accessing the bookmark editing dialog through <guiseq><gui>Bookmarks</gui><gui>Edit Bookmarks</gui></guiseq>.
vi: Các đánh dấu đến mục tiếp cận trong <app>Accerciser</app> được định nghĩa bởi tên ứng dụng và một "path" (đường dẫn) trong phân cấp tiếp cận nội bộ của ứng dụng đến đối tượng tiếp cận được đánh dấu. Khi ứng dụng đích ở một trạng thái khác - tức là nhiều khung cấp cao nhất -, đường dẫn có thể không chính xác. Các đánh dấu có thể được quản lý bằng cách truy cập hộp thoại chỉnh sửa đánh dấu thông qua <guiseq><gui>Bookmarks</gui><gui>Edit Bookmarks</gui></guiseq>.

# sort
source: 4. Event Monitor Plugin
vi: 4. Plugin Theo dõi sự kiện

source: Monitoring accessible events as they occur
vi: Theo dõi các sự kiện tiếp cận khi chúng xảy ra

source: Event Monitor Plugin
vi: Plugin Theo dõi sự kiện

source: The Event Monitor Plugin allows you to view <link href="http://accessibility.linuxfoundation.org/a11yspecs/atspi/adoc/atspi-events.html">AT-SPI events</link> as they occur on the applications exposed in <app>Accerciser</app>'s <link xref="desktop_tree_view">Application Tree View</link>. The plugin is useful to explore the dynamics of an application's interface and verify which accessible widgets are related to which AT-SPI events.
vi: Plugin Theo dõi sự kiện cho phép bạn xem <link href="http://accessibility.linuxfoundation.org/a11yspecs/atspi/adoc/atspi-events.html">các sự kiện AT-SPI</link> khi chúng xảy ra trên các ứng dụng hiển thị trong <link xref="desktop_tree_view">Ô xem cây ứng dụng</link> của <app>Accerciser</app>. Plugin này hữu ích để khám phá sự năng động của giao diện ứng dụng và xác minh widget tiếp cận nào liên quan đến sự kiện AT-SPI nào.

source: The Event Monitor Plugin allows you to view AT-SPI events and match them with accessible widgets.
vi: Plugin Theo dõi sự kiện cho phép bạn xem các sự kiện AT-SPI và khớp chúng với các widget tiếp cận.

source: Running the Event Monitor Plugin
vi: Chạy Plugin Theo dõi sự kiện

source: When you open the Event Monitor Plugin, you see a list of checkboxes representing all the different AT-SPI event classes covered by the plugin:
vi: Khi bạn mở Plugin Theo dõi sự kiện, bạn sẽ thấy danh sách các hộp kiểm đại diện cho tất cả các lớp sự kiện AT-SPI khác nhau được plugin bao phủ:

source: document
vi: tài liệu

source: focus
vi: tiêu điểm

source: mouse
vi: chuột

source: object
vi: đối tượng

source: window
vi: cửa sổ

source: If you check a class, all of its event types will be monitored by the plugin. The classes are exposed as tree structures; therefore, you can refine your selection by expanding them and checking only the event types you really care about.
vi: Nếu bạn chọn một lớp, tất cả các kiểu sự kiện của nó sẽ được plugin theo dõi. Các lớp được hiển thị dưới dạng cấu trúc cây; do đó, bạn có thể tinh chỉnh lựa chọn của mình bằng cách mở rộng chúng và chỉ chọn các kiểu sự kiện bạn thực sự quan tâm.

source: If you want to monitor all possible types of AT-SPI events, press the <cmd>Select All</cmd> button. Similarly, if you want to clear all currently selected event types, press the <cmd>Clear Selection</cmd> button.
vi: Nếu bạn muốn theo dõi tất cả các kiểu sự kiện AT-SPI có thể, nhấn nút <cmd>Select All</cmd>. Tương tự, nếu bạn muốn xóa tất cả các kiểu sự kiện đang được chọn, nhấn nút <cmd>Clear Selection</cmd>.

source: Selecting only a few event types per monitoring gives you a clearer output.
vi: Chỉ chọn một vài kiểu sự kiện mỗi lần theo dõi sẽ cho kết quả rõ ràng hơn.

source: Another way to refine event monitoring is by the event source. By default, the Source option <cmd>Everything</cmd> is selected, indicating that AT-SPI events of all applications will be monitored. If you want to investigate a single application, select it in the Application Tree View and click the Source radio button <cmd>Selected application</cmd>. Likewise, if you want to monitor a single accessible widget and its corresponding descendants, select it in the Application Tree View and click the Source radio button <cmd>Selected accessible</cmd>.
vi: Một cách khác để tinh chỉnh việc theo dõi sự kiện là theo nguồn sự kiện. Theo mặc định, tùy chọn Source <cmd>Everything</cmd> được chọn, cho biết rằng các sự kiện AT-SPI của tất cả các ứng dụng sẽ được theo dõi. Nếu bạn muốn điều tra một ứng dụng đơn lẻ, chọn nó trong Ô xem cây ứng dụng và nhấp vào nút radio Source <cmd>Selected application</cmd>. Tương tự, nếu bạn muốn theo dõi một widget tiếp cận đơn lẻ và các con cháu tương ứng của nó, chọn nó trong Ô xem cây ứng dụng và nhấp vào nút radio Source <cmd>Selected accessible</cmd>.

source: After selecting event types and specifying a Source option, the Event Monitor Plugin starts monitoring AT-SPI events automatically, because the <cmd>Monitor Events</cmd> button is pressed by default. Whenever you want to stop monitoring, click the <cmd>Monitor Events</cmd> button. To restart monitoring, press this button again.
vi: Sau khi chọn các kiểu sự kiện và chỉ định tùy chọn Source, Plugin Theo dõi sự kiện bắt đầu theo dõi các sự kiện AT-SPI một cách tự động, vì nút <cmd>Monitor Events</cmd> được nhấn theo mặc định. Bất cứ khi nào bạn muốn dừng theo dõi, nhấp nút <cmd>Monitor Events</cmd>. Để khởi động lại việc theo dõi, nhấn nút này lần nữa.

source: For each incoming event, the Event Monitor Plugin indicates the source and the application. Activating the link for either of these items will cause it to become selected in the Application Tree View.
vi: Đối với mỗi sự kiện đến, Plugin Theo dõi sự kiện cho biết nguồn và ứng dụng. Kích hoạt liên kết cho bất kỳ mục nào trong số này sẽ khiến nó được chọn trong Ô xem cây ứng dụng.

source: If you want to save the output generated by the Event Monitor Plugin, just press the <cmd>Save</cmd> button. To clear the output screen, you just need to click the <cmd>Clear</cmd> button.
vi: Nếu bạn muốn lưu kết quả được tạo bởi Plugin Theo dõi sự kiện, chỉ cần nhấn nút <cmd>Save</cmd>. Để xóa màn hình kết quả, bạn chỉ cần nhấp nút <cmd>Clear</cmd>.

# sort
source: 2. How to install and run <app>Accerciser</app>
vi: 2. Cách cài đặt và chạy <app>Accerciser</app>

# link
source: Setting up <app>Accerciser</app>
vi: Thiết lập <app>Accerciser</app>

source: Installing and running <app>Accerciser</app> on your system
vi: Cài đặt và chạy <app>Accerciser</app> trên hệ thống của bạn

source: Setting up <app>Accerciser</app>
vi: Thiết lập <app>Accerciser</app>

source: Check if your distribution has <app>Accerciser</app> already packaged. If this is the case, you can install it via its package manager. Otherwise, you can follow the section below to install <app>Accerciser</app> manually.
vi: Kiểm tra xem bản phân phối của bạn đã đóng gói <app>Accerciser</app> chưa. Nếu có, bạn có thể cài đặt nó qua trình quản lý gói. Nếu không, bạn có thể làm theo phần bên dưới để cài đặt <app>Accerciser</app> thủ công.

source: Installing <app>Accerciser</app> manually
vi: Cài đặt <app>Accerciser</app> thủ công

source: To install <app>Accerciser</app> manually, you will need to download it first. <app>Accerciser</app>'s source code can either be downloaded from <link href="http://ftp.gnome.org/pub/GNOME/sources/accerciser/">the gnome.org FTP site</link> or cloned from <link href="https://gitlab.gnome.org/GNOME/accerciser">the gnome.org GIT repository</link>.
vi: Để cài đặt <app>Accerciser</app> thủ công, trước tiên bạn cần tải nó về. Mã nguồn của <app>Accerciser</app> có thể được tải về từ <link href="http://ftp.gnome.org/pub/GNOME/sources/accerciser/">trang FTP gnome.org</link> hoặc nhân bản từ <link href="https://gitlab.gnome.org/GNOME/accerciser">kho GIT gnome.org</link>.

source: If you are not using GNOME 3, you may find that <app>Accerciser</app> version 3 or later is not compatible with your environment.
vi: Nếu bạn không sử dụng GNOME 3, bạn có thể thấy rằng <app>Accerciser</app> phiên bản 3 hoặc mới hơn không tương thích với môi trường của bạn.

source: After getting <app>Accerciser</app>, install it using the following commands:
vi: Sau khi lấy <app>Accerciser</app>, hãy cài đặt nó bằng các lệnh sau:

source: <cmd>sudo meson install -C _build # or meson install -C _build as root</cmd>
vi: <cmd>sudo meson install -C _build # hoặc meson install -C _build với tư cách root</cmd>

source: If you find any problems installing <app>Accerciser</app> on your system, it is likely that some of its dependencies are missing. Check <link href="https://live.gnome.org/Accerciser/#Requirements"> <app>Accerciser</app>'s wiki</link> to make sure you have all dependencies properly installed.
vi: Nếu bạn gặp bất kỳ vấn đề nào khi cài đặt <app>Accerciser</app> trên hệ thống của mình, rất có thể là do thiếu một số phần phụ thuộc. Hãy kiểm tra <link href="https://live.gnome.org/Accerciser/#Requirements"> wiki của <app>Accerciser</app></link> để đảm bảo bạn đã cài đặt đúng tất cả các phần phụ thuộc.

source: Running <app>Accerciser</app>
vi: Chạy <app>Accerciser</app>

source: To start <app>Accerciser</app>, type <cmd>accerciser</cmd> in a terminal window or within the Run dialog and then press <key>Return</key>.
vi: Để bắt đầu <app>Accerciser</app>, gõ <cmd>accerciser</cmd> trong cửa sổ terminal hoặc trong hộp thoại Chạy và sau đó nhấn <key>Return</key>.

source: After that, you can use <app>Accerciser</app> to inspect any accessible item shown in the <link xref="desktop_tree_view">Application Tree View</link>'s hierarchy. Select an item and investigate it using one of <app>Accerciser</app>'s plugins.
vi: Sau đó, bạn có thể sử dụng <app>Accerciser</app> để kiểm tra bất kỳ mục tiếp cận nào được hiển thị trong phân cấp của <link xref="desktop_tree_view">Ô xem cây ứng dụng</link>. Chọn một mục và điều tra nó bằng cách sử dụng một trong các plugin của <app>Accerciser</app>.

# sort
source: 3. Writing New Plugins
vi: 3. Viết các plugin mới

source: Extending <app>Accerciser</app> with your desired functionalities
vi: Mở rộng <app>Accerciser</app> với các chức năng mong muốn của bạn

source: Writing Plugins for <app>Accerciser</app>
vi: Viết các plugin cho <app>Accerciser</app>

source: Extending <app>Accerciser</app> with new plugins became much simpler since <link href="https://wiki.gnome.org/Apps/Accerciser/PluginTutorial">this tutorial</link> was written. Given that it provides a very detailed explanation about the topic, this section consists basically of its original content - only simple editions and updates were done.
vi: Việc mở rộng <app>Accerciser</app> bằng các plugin mới đã trở nên đơn giản hơn nhiều kể từ khi <link href="https://wiki.gnome.org/Apps/Accerciser/PluginTutorial">hướng dẫn này</link> được viết. Do nó cung cấp lời giải thích rất chi tiết về chủ đề này, phần này về cơ bản bao gồm nội dung gốc của nó - chỉ có các chỉnh sửa và cập nhật đơn giản được thực hiện.

source: <app>Accerciser</app> supports three basic types of plugins:
vi: <app>Accerciser</app> hỗ trợ ba loại plugin cơ bản:

source: Base plugins - These plugins are derived from the Plugin base class. They do not provide a visible interface, but could provide additional functionality to <app>Accerciser</app>.
vi: Plugin cơ sở - Những plugin này được dẫn xuất từ lớp cơ sở Plugin. Chúng không cung cấp giao diện hiển thị, nhưng có thể cung cấp chức năng bổ sung cho <app>Accerciser</app>.

source: Console plugins - These plugins provide simple console output into a text area in a plugin tab. Not to be confused with the packaged <link xref="ipython_plugin">IPython Console Plugin</link>.
vi: Plugin console - Những plugin này cung cấp đầu ra console đơn giản vào vùng văn bản trong thẻ plugin. Đừng nhầm lẫn với <link xref="ipython_plugin">Plugin Console IPython</link> đã đóng gói.

source: Viewport plugins - The majority of <app>Accerciser</app> default plugins. They provide a custom graphical interface in a tab.
vi: Plugin khung xem - Đa số các plugin mặc định của <app>Accerciser</app>. Chúng cung cấp giao diện đồ họa tùy chỉnh trong một thẻ.

source: Creating a Base Plugin
vi: Tạo một Plugin cơ sở

source: We will create a simplified version of the <link xref="quick_select_plugin">Quick Select Plugin</link>. This plugin will select the last focused accessible when pressing <keyseq><key>ctrl</key><key>alt</key><key>e</key></keyseq>.
vi: Chúng ta sẽ tạo một phiên bản đơn giản hóa của <link xref="quick_select_plugin">Plugin Chọn nhanh</link>. Plugin này sẽ chọn đối tượng tiếp cận được focus cuối cùng khi nhấn <keyseq><key>ctrl</key><key>alt</key><key>e</key></keyseq>.

source: First off, the import lines we will use are:
vi: Đầu tiên, các dòng import mà chúng ta sẽ sử dụng là:

source: Next we will derive a new class from the Plugin base class, and assign some mandatory class attributes:
vi: Tiếp theo, chúng ta sẽ dẫn xuất một lớp mới từ lớp cơ sở Plugin, và gán một số thuộc tính lớp bắt buộc:

source: class FocusSelect(Plugin): plugin_name = 'Focus Select' plugin_description = 'Allows selecting last focused accessible.'
vi: class FocusSelect(Plugin): plugin_name = 'Chọn tiêu điểm' plugin_description = 'Cho phép chọn đối tượng tiếp cận được focus cuối cùng.'

source: We will now override the init method, in which we will set a global key action for selecting the last focused accessible item, register an event listener for the "focus" event, and set the <cmd>last_focused</cmd> instance variable to <cmd>None</cmd>.
vi: Bây giờ chúng ta sẽ ghi đè phương thức init, trong đó chúng ta sẽ đặt một hành động phím tắt toàn cục để chọn mục tiếp cận được focus cuối cùng, đăng ký trình lắng nghe sự kiện cho sự kiện "focus", và đặt biến instance <cmd>last_focused</cmd> thành <cmd>None</cmd>.

source: def init(self): pyatspi.Registry.registerEventListener(self.accEventFocusChanged, 'focus') self.global_hotkeys = [('Inspect last focused accessible', self.inspectLastFocused, gtk.keysyms.e, gtk.gdk.CONTROL_MASK | gtk.gdk.MOD1_MASK)] self.last_focused = None
vi: def init(self): pyatspi.Registry.registerEventListener(self.accEventFocusChanged, 'focus') self.global_hotkeys = [('Kiểm tra đối tượng tiếp cận được focus cuối cùng', self.inspectLastFocused, gtk.keysyms.e, gtk.gdk.CONTROL_MASK | gtk.gdk.MOD1_MASK)] self.last_focused = None

source: Notice that the <cmd>global_hotkeys</cmd> instance variable is a list of tuples. Each tuple is a global hotkey action, composed by an action description, a desired method to call, a key symbol of keypress, and a key modifier mask.
vi: Lưu ý rằng biến instance <cmd>global_hotkeys</cmd> là một danh sách các tuple. Mỗi tuple là một hành động phím tắt toàn cục, bao gồm mô tả hành động, phương thức mong muốn để gọi, ký hiệu phím của lần nhấn phím, và mặt nạ bổ trợ phím.

source: In the "focus" event callback, we assign the <cmd>last_focused</cmd> instance variable with the accessible item that has just emitted the "focus" event.
vi: Trong callback sự kiện "focus", chúng ta gán biến instance <cmd>last_focused</cmd> với mục tiếp cận vừa phát ra sự kiện "focus".

source: In the hotkey action callback, we update the application wide node with the last focused accessible item, if we have recorded it:
vi: Trong callback hành động phím tắt, chúng ta cập nhật nút trên toàn ứng dụng với mục tiếp cận được focus cuối cùng, nếu chúng ta đã ghi lại nó:

source: Creating a Console Plugin
vi: Tạo một Plugin console

source: We will create a console plugin to display focus changes emitted by an accessible item with a "push button" role - remember that it is easy to check what is the role of any item with <app>Accerciser</app>; you can verify it in the <link xref="desktop_tree_view">Application Tree View</link>, for example.
vi: Chúng ta sẽ tạo một plugin console để hiển thị các thay đổi tiêu điểm được phát ra bởi một mục tiếp cận có vai trò "push button" - hãy nhớ rằng rất dễ kiểm tra vai trò của bất kỳ mục nào với <app>Accerciser</app>; ví dụ, bạn có thể xác minh nó trong <link xref="desktop_tree_view">Ô xem cây ứng dụng</link>.

source: The needed import lines are:
vi: Các dòng import cần thiết là:

source: Then we add a class definition, with a plugin name and description:
vi: Sau đó, chúng ta thêm định nghĩa lớp, với tên và mô tả plugin:

source: class PushButtonFocus(ConsolePlugin): plugin_name = 'Push Button Focus' plugin_description = 'Print event when pushbutton get\'s focus.'
vi: class PushButtonFocus(ConsolePlugin): plugin_name = 'Tiêu điểm nút nhấn' plugin_description = 'In sự kiện khi nút nhấn nhận được tiêu điểm.'

source: We override the init method adding a register listener:
vi: Chúng ta ghi đè phương thức init thêm một trình lắng nghe đăng ký:

source: In the callback method, all push button events are printed.
vi: Trong phương thức callback, tất cả các sự kiện nút nhấn được in ra.

source: Creating a Viewport Plugin
vi: Tạo một Plugin khung xem

source: We will create a viewport plugin that allows quick testing of the "click" action in accessible items that support the AT-SPI Action interface and have an action named "click". It will be a simple button that, once clicked, does the "click" action in the accessible.
vi: Chúng ta sẽ tạo một plugin khung xem cho phép kiểm tra nhanh hành động "click" (nhấp) trong các mục tiếp cận hỗ trợ giao diện Action (Hành động) của AT-SPI và có một hành động tên là "click". Nó sẽ là một nút đơn giản mà khi được nhấp, sẽ thực hiện hành động "click" trong đối tượng tiếp cận.

source: First off, some mandatory import lines:
vi: Đầu tiên, một số dòng import bắt buộc:

source: Next, a class definition, with a name and description:
vi: Tiếp theo, một định nghĩa lớp, với tên và mô tả:
